# Dispose Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
SetupEnergySimulationDialog..::..Dispose Method
SetupEnergySimulationDialog Class See Also
---
Releases all resources used by the SetupEnergySimulationDialog
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 22.0.0.0 (22.1.0.0)
# Syntax
C#
---
```text
public void Dispose()
```

Visual Basic
---
```text
Public Sub Dispose
```

Visual C++
---
```text
public:
virtual void Dispose() sealed
```

# ### Implements
IDisposable..::..Dispose()()()()
# See Also
SetupEnergySimulationDialog Class
Autodesk.Revit.UI Namespace